In [21]:
# making group of the data
import pandas as pd

In [22]:
df = pd.read_csv("t29_z.csv")
df.head()

,Unnamed: 0,Name,Colour Code,RGB,sales,sales_fill,int_sale,Prise
0,0,White,#FFFFFF,"rgb(100,100,100)",12.0,12.000000,12,60
1,1,Silver,#C0C0C0,"rgb(75,75,75)",22.0,22.000000,22,110
2,2,Gray,#808080,"rgb(50,50,50)",34.0,34.000000,34,170
3,3,Black,#000000,"rgb(0,0,0)",NaN,36.266667,36,180
4,4,Red,#FF0000,"rgb(100,0,0)",45.0,45.000000,45,225

In [23]:
bins = [0,15,30,float('inf')]
labels = ["Poor","Good","Excelent"]
df["Type"]= pd.cut(df["int_sale"],bins=bins,labels=labels,right=False)

In [24]:
df.head()

,Unnamed: 0,Name,Colour Code,RGB,sales,sales_fill,int_sale,Prise,Type
0,0,White,#FFFFFF,"rgb(100,100,100)",12.0,12.000000,12,60,Poor
1,1,Silver,#C0C0C0,"rgb(75,75,75)",22.0,22.000000,22,110,Good
2,2,Gray,#808080,"rgb(50,50,50)",34.0,34.000000,34,170,Excelent
3,3,Black,#000000,"rgb(0,0,0)",NaN,36.266667,36,180,Excelent
4,4,Red,#FF0000,"rgb(100,0,0)",45.0,45.000000,45,225,Excelent

In [25]:
df.tail()

,Unnamed: 0,Name,Colour Code,RGB,sales,sales_fill,int_sale,Prise,Type
11,11,Teal,#008080,"rgb(0,50,50)",29.0,29.0,29,145,Good
12,12,Blue,#0000FF,NaN,27.0,27.0,27,135,Good
13,13,NaN,#000080,"rgb(0,0,50)",33.0,33.0,33,165,Excelent
14,14,Fuchsia,#FF00FF,"rgb(100,0,100)",62.0,62.0,62,310,Excelent
15,15,Purple,NaN,"rgb(50,0,50)",26.0,26.0,26,130,Good

In [26]:
group_sum  = df.groupby("Type")["Prise"].mean()
print(group_sum)

Type
Poor         55.000000
Good        129.000000
Excelent    238.333333
Name: Prise, dtype: float64

C:\Users\hp\AppData\Local\Temp\ipykernel_11716\4161413946.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  group_sum  = df.groupby("Type")["Prise"].mean()

In [27]:
group_total  = df.groupby("Type")["Prise"].sum()
print(group_total)

Type
Poor         110
Good         645
Excelent    2145
Name: Prise, dtype: int64

C:\Users\hp\AppData\Local\Temp\ipykernel_11716\2517361872.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  group_total  = df.groupby("Type")["Prise"].sum()

In [28]:
group_prop = df.groupby("Type")["Prise"].agg(["sum","mean","count"])
print(group_prop)

           sum        mean  count
Type
Poor       110   55.000000      2
Good       645  129.000000      5
Excelent  2145  238.333333      9

C:\Users\hp\AppData\Local\Temp\ipykernel_11716\501316172.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  group_prop = df.groupby("Type")["Prise"].agg(["sum","mean","count"])

In [39]:
# Merging and joining
df1 = pd.DataFrame({"Key":["a","b","c"],"Value1":[2,3,6]})
df2 = pd.DataFrame({"Key":["a","e","f"],"Value2":[7,9,1]})

In [40]:
df2

  Key  Value2
0   a       7
1   e       9
2   f       1

In [41]:
df1

  Key  Value1
0   a       2
1   b       3
2   c       6

In [42]:
pd.merge(df1,df2,on="Key",how="inner")

  Key  Value1  Value2
0   a       2       7

In [46]:
pd.merge(df1,df2,on="Key",how="outer")

  Key  Value1  Value2
0   a     2.0     7.0
1   b     3.0     NaN
2   c     6.0     NaN
3   e     NaN     9.0
4   f     NaN     1.0

In [47]:
pd.merge(df1,df2,on="Key",how="left")

  Key  Value1  Value2
0   a       2     7.0
1   b       3     NaN
2   c       6     NaN

In [48]:
pd.merge(df1,df2,on="Key",how="right")

  Key  Value1  Value2
0   a     2.0       7
1   e     NaN       9
2   f     NaN       1